const merchants = [
  {
    name: "渝水优品农展馆",
    amt: 1354625.31,
  },
  {
    name: "秀才商行",
    amt: 1162397.97,
  },
  {
    name: "江钢暨阳店",
    amt: 857619.24,
  },
  {
    name: "鹏泰超市",
    amt: 562477.95,
  },
  {
    name: "江钢抱石店",
    amt: 390315.8,
  },
  {
    name: "鸿兴超市名仕公馆店",
    amt: 283512.48,
  },
  {
    name: "江钢北湖帝景店",
    amt: 275605.8,
  },
  {
    name: "鸿兴超市暨阳店",
    amt: 217454.08,
  },
  {
    name: "鸿兴超市一水天城店",
    amt: 201963.73,
  },
  {
    name: "新余经开区食堂",
    amt: 170945.01,
  },
  {
    name: "江钢苗圃店",
    amt: 158365.17,
  },
  {
    name: "鸿兴超市金盾花园店",
    amt: 129350.23,
  },
  {
    name: "鸿兴超市长青店",
    amt: 121563.55,
  },
  {
    name: "工数投食堂",
    amt: 114410.1,
  },
  {
    name: "鸿兴超市中央公园店",
    amt: 87450.21,
  },
  {
    name: "江钢北村店",
    amt: 71561.7,
  },
  {
    name: "江南饭店",
    amt: 68388.91,
  },
  {
    name: "酸柠檬上亿工匠梦想店",
    amt: 45844.9,
  },
  {
    name: "新钢街道办食堂",
    amt: 44863,
  },
  {
    name: "酸柠檬恒太城店",
    amt: 36936.41,
  },
  {
    name: "酸柠檬抱石旗舰店",
    amt: 34778.58,
  },
  {
    name: "江南红新味来",
    amt: 32469.5,
  },
  {
    name: "酸柠檬高能欧洲体验店",
    amt: 29366.3,
  },
  {
    name: "悦嘉福农庄北湖店",
    amt: 25402.8,
  },
  {
    name: "酸柠檬燕子山概念店",
    amt: 21188.8,
  },
  {
    name: "黎安养殖场构树土猪肉",
    amt: 20225.3,
  },
  {
    name: "酸柠檬北湖星城店",
    amt: 19526.2,
  },
  {
    name: "酸柠檬高新私享店",
    amt: 16962.5,
  },
  {
    name: "悦嘉福暨阳店",
    amt: 14397.01,
  },
  {
    name: "优鲜优果生活超市",
    amt: 14221.85,
  },
  {
    name: "诗苏国风酥点店（上亿店）",
    amt: 13903.53,
  },
  {
    name: "渝控供应链3",
    amt: 13855.55,
  },
  {
    name: "酸柠檬暨阳亚太工匠店",
    amt: 13442.3,
  },
  {
    name: "酸柠檬桥北卓越店",
    amt: 11655.9,
  },
  {
    name: "小隐楼",
    amt: 10217,
  },
  {
    name: "下保地球仓",
    amt: 10015.4,
  },
  {
    name: "都康有机蔬菜店（长青北路店）",
    amt: 9337.05,
  },
  {
    name: "悦嘉福农庄(暨阳店)",
    amt: 8690.7,
  },
  {
    name: "为根副食店",
    amt: 8321,
  },
  {
    name: "酸柠檬御天城店",
    amt: 7957.5,
  },
  {
    name: "诗苏国风酥点店（恒太城店）",
    amt: 7847.01,
  },
  {
    name: "诗苏国风酥点店（高能店）",
    amt: 7525.59,
  },
  {
    name: "悦嘉福城南店",
    amt: 7282,
  },
  {
    name: "江南红原味店",
    amt: 7103,
  },
  {
    name: "数投测试",
    amt: 6400.31,
  },
  {
    name: "悦嘉福农庄帝海店",
    amt: 5512.4,
  },
  {
    name: "城南办食堂",
    amt: 5450,
  },
  {
    name: "酸柠檬安鑫雅庭店",
    amt: 5309.6,
  },
  {
    name: "凯光餐饮",
    amt: 3734,
  },
  {
    name: "三姐妹",
    amt: 3725.25,
  },
  {
    name: "悦嘉福竹山路店",
    amt: 3390.4,
  },
  {
    name: "下保地球仓1",
    amt: 2837,
  },
  {
    name: "龙泉社区食堂",
    amt: 2799.6,
  },
  {
    name: "都康有机蔬菜店（城南人民北路店）",
    amt: 2667.03,
  },
  {
    name: "合芯食堂",
    amt: 2430,
  },
  {
    name: "江南红有机蔬菜（新钢店）",
    amt: 2361.52,
  },
  {
    name: "老上海风情街",
    amt: 2016.04,
  },
  {
    name: "新余弘凌文旅有限公司",
    amt: 1530.01,
  },
  {
    name: "渝水区赣西大道江钢超市",
    amt: 1191.44,
  },
  {
    name: "凯光乐园",
    amt: 1020,
  },
  {
    name: "都康有机蔬菜店（暨阳店）",
    amt: 857.99,
  },
  {
    name: "金色海岸扶贫馆",
    amt: 833.63,
  },
  {
    name: "久途商行",
    amt: 823.5,
  },
  {
    name: "区投控二楼食堂",
    amt: 540,
  },
  {
    name: "绿文源香米专营店",
    amt: 182,
  },
  {
    name: "渝水区北湖中路成红鲜果店",
    amt: 172.8,
  },
  {
    name: "渝水区北湖东路新富豪超市",
    amt: 152,
  },
  {
    name: "江南红（暨阳店）",
    amt: 3.62,
  },
  {
    name: "江南红（春江花月店）",
    amt: 1.52,
  },
  {
    name: "江南红城南店",
    amt: 0.25,
  },
  {
    name: "凯光酒店",
    amt: 0.1,
  },
  {
    name: "厨娘红",
    amt: 0.07,
  },
  {
    name: "江南红老味道",
    amt: 0.03,
  },
  {
    name: "江南红（龙泉湾店）",
    amt: 0.03,
  },
  {
    name: "江南红（竹山路店）",
    amt: 0.02,
  },
  {
    name: "江南红（江南厨子店）",
    amt: 0.02,
  },
  {
    name: "江南红（人民医院店）",
    amt: 0.02,
  },
  {
    name: "江南红（春龙店）",
    amt: 0.02,
  },
  {
    name: "江西鑫磊餐饮有限公司",
    amt: 0.02,
  },
  {
    name: "渝水区茶山路东鸿生鲜超市",
    amt: 0.02,
  },
  {
    name: "老上",
    amt: 0.01,
  },
  {
    name: "悦嘉福新钢店",
    amt: 0,
  },
  {
    name: "行政审批局江南红食堂",
    amt: 0,
  },
  {
    name: "渝控供应链2",
    amt: 0,
  },
];

export const generateMerchantsTop6 = () => {
  return merchants.sort((a, b) => b.amt - a.amt).slice(0, 6);
  // return getRandomElements(merchants, 6);
};
